{"page_content": "Proceedings of 15th International Conference on Science and Innovative Engineering 2025 \nApril 26th - 27th, 2025 \nPrince Dr.K.Vasudevan college of Engineering and Technology, India  \nManipal University College Malaysia, Melaka, Malaysia           ISBN 978-81-983498-5-9                                                                                                                       \n \n \nJerusalem College of Engineering, Chennai-600100. \n \nIn the era of big data, cloud storage services have become a fundamental tool for managing and storing \nlarge volumes of data. However, with the increase in data storage, the challenge of data deduplication—\neliminating duplicate copies of repeating data—becomes critical to optimize storage space and reduce \ncosts. ABATE (Deduplication Using Blockchain with Hybrid RSA) is a secure deduplication algorithm \ndesigned specifically for textual data in cloud environments. The algorithm employs a hybrid RSA \nencryption method combined with blockchain technology to ensure data integrity, privacy, and security \nduring the deduplication process. The hybrid RSA mechanism allows for secure encryption and \ndecryption, enabling the deduplication process to occur without exposing sensitive data to potential \nthreats. Blockchain, known for its decentralized and immutable ledger, provides a robust framework to \nrecord deduplication events, ensuring transparency and traceability while preventing unauthorized data \nalterations. ABATE not only minimizes storage redundancy but also maintains a high level of security, \naddressing the critical concerns of data breaches and privacy in cloud environments. The proposed \nsolution is evaluated in various cloud scenarios, demonstrating its effectiveness in reducing storage \ncosts while safeguarding data integrity and confidentiality.  \n \n114. EVISEEK - ADVANCED GRIEVANCE RESOLUTION PLATFORM \n  \nDr. Anuratha K \nHarini R \nHarinee M \nDepartment of Information Technology \nSri Sairam Institute of Technology \nChennai. India \n \nEVISEEK is an innovative digital grievance handling system designed to address inefficiencies, \nopacity, and delays in resolving issues, ensuring a more efficient and transparent process. The platform \nprovides a streamlined approach to issue submission, tracking, and resolution, empowering users and \nadministrators alike with a seamless and user-friendly interface. A unique feature of EVISEEK is its \nability to display submitted grievances to all users anonymously, promoting transparency while \nsafeguarding privacy. This ensures that users can engage with the platform without fear of retaliation, \nfostering collective accountability and engagement. Built on a robust role-based access model, \nEVISEEK ensures secure and efficient interaction among users, administrators, and staff within a \nscalable environment. The system allows users to easily register, submit complaints, track their status \nin real-time, and manage their profiles. Administrators and staff can efficiently monitor incoming \ngrievances, manage resolutions, and track the progress of ongoing issues, ensuring timely and \nresponsible action. Developed using PHP and MySQL, EVISEEK prioritizes data integrity, security, \nand scalability, making it adaptable to organizations of various sizes and structures. The system is \ndesigned to be flexible and customizable, ensuring its applicability in a wide range of contexts, from \ncommunity organizations to large corporations. EVISEEK modernizes grievance redressal processes \nby fostering transparency, efficiency, and trust, offering a comprehensive solution to address critical \nchallenges in issue resolution, improving communication, and ensuring a more accountable system for \nall stakeholders. \n \n115. NOTE ON GRAPHS BASED ON SIDON SETS \n \nA. Kokiladevi S, \nB. Yegnanarayanan Venkataraman \nA, B. Kalasalingam Academy of Research and Education, \nKrishnan koil, India", "metadata": {"producer": "iLovePDF", "creator": "PyPDF", "creationdate": "", "moddate": "2025-05-10T13:41:12+00:00", "source": "sample.pdf", "total_pages": 3, "page": 0, "page_label": "1"}}
{"page_content": "Proceedings of 15th International Conference on Science and Innovative Engineering 2025 \nApril 26th - 27th, 2025 \nPrince Dr.K.Vasudevan college of Engineering and Technology, India  \nManipal University College Malaysia, Melaka, Malaysia           ISBN 978-81-983498-5-9                                                                                                                       \n \n \n \nSidon sets-SSs are subsets of real numbers possessing different totals for pair wise sums. Simon Sidon \nintroduced it to settle a problem in harmonic analysis. Sidon, Erdos and Turan formed a group of three \nto popularize its study in 1934. In the field of combinatorics, the SSs are hotly pursued objects as these \nare employed in graph theory, coding theory, distributed computing etc. The task of determining the \nTuran number of a cycle graph on four vertices is pertinent and widely investigated since 1938 when \nErdos posed it for the first time.  It is one of the frequently studied problems in extremal graph theory. \nSSs are employed to build C4 free graphs. We discuss here a useful generalization to the investigation \nabout these sets with the help of graphs in graph theory. We have given a bird’s eye view about a) Turan \nsets and SSs and b) almost perfect non-linear functions and SSs. C) SSs in graph coloring, d) SS subsets \nof Random set of Integers and e) Multiplicative SSs. We also derived a useful bound from below on the \ncount of C4 ‘s in a bipartite graph. \n \n \n116. SMART MOBILITY WHEELCHAIR USING IOT AND AI \n \nDuraiMurugan A \nAssistant Professor \nSeema S \nBhavalDharshini S \nSujitha K \nLitthika S \nUG Scholar \nDepartment of CSBS \nM.Kumarasamy college of engineering \nKarur, India \n \n  \nThe IoT-enabled smart wheelchair designed for individuals with mobility impairments, traditional \nwheelchairs provide essential support, but they often lack the intelligence needed for enhanced safety, \nease of use, and remote monitoring. This project focuses on developing an IoT-enabled smart \nwheelchair that not only improves mobility but also ensures user safety and allows caregivers to stay \nconnected in real time.At the core of this smart wheelchair is an Arduino Uno microcontroller, which \nintegrates several advanced features. To prevent collisions, an ultrasonic sensor detects obstacles and \ntriggers a buzzer alert, and if needed, the system can automatically stop the wheelchair to avoid \naccidents. Additionally, an accident detection sensor continuously monitors for sudden impacts or tilts, \nwhich could indicate a fall or collision. If such an event occurs, the system immediately sends the GPS \nlocation of the wheelchair to caregivers or emergency services through an IoT platform, ensuring quick \nassistance.One of the standout features of this wheelchair is voice-controlled navigation, allowing users \nto move effortlessly by giving simple voice commands like “forward,” “reverse,” “left,” and “right.” \nThis is especially beneficial for individuals with limited hand mobility. Users can control the wheelchair \nthrough an IoT-connected mobile app or a voice assistant, making operation intuitive and \naccessible.The IoT platform also provides real-time updates, including location tracking, battery status, \nand emergency alerts. Caregivers can remotely monitor the wheelchair’s status, ensuring that users \nremain safe and that help is available when needed.By combining smart navigation, automated \nemergency response, and remote monitoring, this IoT-based smart wheelchair enhances both safety and \nindependence. It is designed to empower individuals with mobility challenges, giving them greater \nfreedom and peace of mind in their daily lives.", "metadata": {"producer": "iLovePDF", "creator": "PyPDF", "creationdate": "", "moddate": "2025-05-10T13:41:12+00:00", "source": "sample.pdf", "total_pages": 3, "page": 1, "page_label": "2"}}
{"page_content": "Proceedings of 15th International Conference on Science and Innovative Engineering 2025 \nApril 26th - 27th, 2025 \nPrince Dr.K.Vasudevan college of Engineering and Technology, India  \nManipal University College Malaysia, Melaka, Malaysia           ISBN 978-81-983498-5-9                                                                                                                       \n \n \n117. LMS PLATFORM USING GENERATIVE AI \n \nRuben George Varghese \nDharshan R E \nHarish Jayaram S S \nR Dheepthi \nComputer Science and Engineering \nHindustan Institute of Technology and Science, \nChennai, Tamil Nadu, India \n \nThe \"LMS Platform Using Generative AI\" addresses the lack of personalized and engaging learning \nresources in traditional Learning Management Systems (LMS). By overcoming the limitations of static \ncontent, the platform enhances learning effectiveness, accessibility, and education quality. The solution \nintegrates generative AI to create interactive, customized study materials tailored to individual learner \nneeds. Key components include Clerk for authentication, Inngest, PostgreSQL and Drizzle for scalable \ndatabase management, Gemini AI for accurate content generation, Next.js for a seamless frontend \nexperience, and a payment gateway for monetization. This combination of technologies ensures a \nrobust, adaptive, and user-centric learning experience. \n \n \n118. HYBRID GRU-CNN APPROACH FOR INSIDER ATTACK CLASSIFICATION \nIN CLOUD NETWORKS \n \nArul Selvam P1 \nTamije Selvy P2 \nAssistant Professor/ Department of CSE Professor/ Department of CSE \nHindusthan College of Engineering and Technology \nCoimbatore \n \nRegarding cloud-based networking architecture, one critical task is categorizing attacks from insiders. \nResearchers found that insiders were likely responsible for around 27 per cent of all cyberattacks \nincidences. Despite the fact that there are already numerous research operations in this area, our \nsuggested attack categorization methodology will help any cloud-based company cope with the \ninterpretation of threat detection situations and develop effective defence tactics. The four types of \ninsider assaults (accidental, negligent, mischievous, and malicious) are always taken seriously. In the \nrealm of insider attacks, machine learning (ML) is presently rising in importance. Choosing the best \nML classifier for detecting the type of insider attack, on the other hand, remains difficult. While machine \nlearning (ML) has made great strides in the field of insider threat identification, existing research has \nnot taken into account the insiders' time-sequence-centric dynamic behavior. To this end, we used a \nGRU-CNN (Gated Recurrent Unit-Convolutional Neural Network) hybrid ML approach to categorize \nthe assaults. CNN can derive local aspects of static patterns but cannot extract the data or association \nactivities in a sequence pattern. In contrast, GRU can efficiently derive the data or associated \noecumenical activities in a sequence pattern, which a standard CNN classifier cannot do. Therefore, the \nmodel is first trained using pre-existing static patterns over a wide range of time sequences and contexts. \nThe insider attack is then categorized using various case studies. The Insider Threat Test Dataset \ndeveloped by the Software Engineering Institute (SEI) at Carnegie Mellon University was used to assess \nthe effectiveness of the suggested model for threat classification. In the training phase, the proposed \nHybrid Classification Strategy (HCS) was found to be 98.43% accurate and had a false positive rate of \n0.17% for known insider threats. In contrast, in the testing phase, it was found to be 97.12% accurate \nand attained a false-positive rate of 2.88% for dynamic insider threats when compared to state-of-the-\nart methods.", "metadata": {"producer": "iLovePDF", "creator": "PyPDF", "creationdate": "", "moddate": "2025-05-10T13:41:12+00:00", "source": "sample.pdf", "total_pages": 3, "page": 2, "page_label": "3"}}
